#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bangkit/learn-terraform-github-actions/runs/run-QihZvfjkifYHDs2J

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
google_compute_network.vpc: Refreshing state... [id=projects/lyrical-ward-382514/global/networks/k8s-vpc]
google_storage_bucket.bucket_models: Refreshing state... [id=models-lyrical-ward-382514]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/lyrical-ward-382514/regions/us-central1/subnetworks/k8s-subnet]
google_container_cluster.primary: Refreshing state... [id=projects/lyrical-ward-382514/locations/us-central1-c/clusters/hello-world]
google_container_node_pool.primary_nodes: Refreshing state... [id=projects/lyrical-ward-382514/locations/us-central1/clusters/hello-world/nodePools/hello-world]
google_compute_subnetwork.subnet: Drift detected (update)
google_container_cluster.primary: Drift detected (update)
google_container_node_pool.primary_nodes: Drift detected (delete)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "TF_VAR_gcp_credential"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-QihZvfjkifYHDs2J/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "TF_VAR_gcp_project" but
│ a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-QihZvfjkifYHDs2J/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.primary must be replaced
-/+ resource "google_container_cluster" "primary" {
      ~ cluster_ipv4_cidr           = "10.144.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "34.171.111.228" -> (known after apply)
      ~ id                          = "projects/lyrical-ward-382514/locations/us-central1-c/clusters/hello-world" -> (known after apply)
      ~ initial_node_count          = 1 -> 2 # forces replacement
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ location                    = "us-central1-c" -> "us-central1" # forces replacement
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.25.7-gke.1000" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                        = "hello-world"
      ~ network                     = "projects/lyrical-ward-382514/global/networks/k8s-vpc" -> "k8s-vpc"
      ~ networking_mode             = "ROUTES" -> (known after apply)
      ~ node_locations              = [] -> (known after apply)
      ~ node_version                = "1.25.7-gke.1000" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "lyrical-ward-382514" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/lyrical-ward-382514/zones/us-central1-c/clusters/hello-world" -> (known after apply)
      ~ services_ipv4_cidr          = "10.147.240.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/lyrical-ward-382514/regions/us-central1/subnetworks/k8s-subnet" -> "k8s-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)
        # (6 unchanged attributes hidden)

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      - master_auth {
          - client_key             = (sensitive value) -> null
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQVBTTk9SNjlRejBUbC9Fa2t0UU5WUVV3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa1lUTTVNV1prTVdNdE1UUXlaUzAwT1RNMUxUbGtOMkl0TjJZM05EWTROalZpT0dReQpNQ0FYRFRJek1EUXlPREE0TXpjeE1sb1lEekl3TlRNd05ESXdNRGt6TnpFeVdqQXZNUzB3S3dZRFZRUURFeVJoCk16a3habVF4WXkweE5ESmxMVFE1TXpVdE9XUTNZaTAzWmpjME5qZzJOV0k0WkRJd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FEQnQ1aXA4N0w0TEtCVzVITWl6YjZGV0czQmUrQ3hscmNsMnZ0Vgo5emVQTXB0WGlZU2VjbTZ6TVdLTjN5TEZ3YmdnUWFxRHZ4T01wRWJkVHllSlhOV3c5N3pKaFJkNlI3eTNrVzd1Ckp5UC81VGw5M0tyRWFpcjZtc0JqbXV2WlFJdEV5YjQ4aGYwZ2NtNEx6NlFrNDhEZDV5Y25LTnFKZW11T0M5S2IKaG94QUtManlIbW1HQm8zNStZN1kvRG5CWHcvZlVjM2N0bTg3Y3dtK2dLblZMeGtiWFJDa04vRWJtNTdqYzNXUApnSVd0Ni9Ca2RQY0U3THFJL1dPQUI1eUlpSWRWNXdzRmJwVXVwRGxOeG9aN2ZvN2NZMzVEMzc1T3UrQ3drMXREClZhQUlNdFViTU9peUNaNGRUM2Q2WmdHSGlZZlIwckdhT3lYakhwUzZOU3ZXOFM1eWF1dk5GT09RRlBLeW1JUzIKdllzM0RCTlA1SVRTTU1qc2RSOTNtUzZRalhadjVVTlc5cmJEZnN0UHk5U2NjV2tjOEh1aUs4TG4zZG1wNER1MQpQNzlLZDJkN2d2OXZEdTl1cmVyY0V6eXVmVjc5T3FqanczTXV6VlJVNFpIN0JBWkJ0bWFOazk5SnlNbnZCbVgvCmd4TWhtaVlpeWU2R0pxOHIvMGgwelI4MG1zc0NBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGUGw1QlUvbzZIWXdWLzl5NDB1WmlFNllsdGwyTUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQld0TTZ0R2xBKzgwYkUrTDZjRzBYY0ljd2tFcnVJaU5lcjc0R0xTOFRlCmF1RUJLSm9VVi81aWJ5WmxsVnJwQ1FmWHF4U0ZlQWJlK05aU2plbDhhRmsyQ2VDOHJSeEpES2szTzFKR1k0K0IKK01rZ3hrK29UTVg4MEp4SVNrRTU3Nk1jYWhzK3JweG5uQURTTnI3TTcvSXI1R1lxbjhlbkZQMGp5c2UwVm90eQoyUUhveXl1SzRBdHArRXorbWJvVmtpaFFaeFE3VG43UTJ0S0dINU9yVVh0b1lhdHVZOHVEb1J2RGk5QVlTeDVVCm0rVmtWZmtPMzU3SDJDTVhIS281UGFlRS9aTEZJVzEvUTNJWlExUnRQcTVnM0lIeURjeWRPZFM0Rk5WRkx1VXgKOG1leXRpaHdqa2NvYjB0RkZvd1o0UWlULzd5UDFnSVRPNk11bmtoemxtSGlFTE1YVFROT2pFWlFacm9wNTJieQozWHBQNm1nV1FkL0ViLzk2Wk5Bek9MbzBhN2pNWUdDV1dGSjgrNWQ1NXVlVlEzU2VJNTg3MmVYNHRIY3hsdXl0CitPdlFvZWtabmNBb0I2Q21Hai93UU9KdkFuUWFBajR4T1RmdUliYUZvN1htRG5sSW9WM0RxbTBNbG5VVSs2aW4KQUlzaHdkQUNOZkEvUGhYR0NPVkQ5U0k9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

          - client_certificate_config {
              - issue_client_certificate = false -> null
            }
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "192.168.0.2" -> null
          - public_endpoint         = "34.171.111.228" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }
    }

  # google_container_node_pool.primary_nodes will be created
  + resource "google_container_node_pool" "primary_nodes" {
      + cluster                     = "hello-world"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "hello-world"
      + name_prefix                 = (known after apply)
      + node_count                  = 2
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "env" = "lyrical-ward-382514"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n1-standard-1"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + tags              = [
              + "gke-node",
              + "lyrical-ward-382514-gke",
            ]
          + taint             = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @Dimaspadma, Action: `pull_request`*